sabre_docs/Trip_Report/Trip_ReportsRQ_1.3.0/Trip_ReportsRQ_1.3.0.wsdl

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:xsd1="http://webservices.sabre.com/triprecord" xmlns:tns="https://webservices.sabre.com/websvc" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader" xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" targetNamespace="https://webservices.sabre.com/websvc">
	<types>
		<xsd:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema">
			<xsd:import namespace="http://schemas.xmlsoap.org/ws/2002/12/secext" schemaLocation="wsse.xsd"/>
			<xsd:import namespace="http://www.ebxml.org/namespaces/messageHeader" schemaLocation="msg-header-2_0.xsd"/>

			<xsd:import namespace="http://webservices.sabre.com/triprecord" schemaLocation="Trip_ReportsRQRS_1.3.0.xsd"/>

		</xsd:schema>
	</types>
	<message name="Trip_ReportsInput">
		<part name="header" element="eb:MessageHeader"/>
		<part name="header2" element="wsse:Security"/>
		<part name="body" element="xsd1:Trip_ReportsRQ"/>
	</message>
	<message name="Trip_ReportsOutput">
		<part name="header" element="eb:MessageHeader"/>
		<part name="header2" element="wsse:Security"/>
		<part name="body" element="xsd1:Trip_ReportsRS"/>
	</message>
	<portType name="Trip_ReportsPortType">
		<operation name="Trip_ReportsRQ">
			<input message="tns:Trip_ReportsInput"/>
			<output message="tns:Trip_ReportsOutput"/>
		</operation>
	</portType>
	<binding name="Trip_ReportsSoapBinding" type="tns:Trip_ReportsPortType">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<operation name="Trip_ReportsRQ">
			<soap:operation soapAction="OTA"/>
			<input>
				<soap:header message="tns:Trip_ReportsInput" part="header" use="literal"/>
				<soap:header message="tns:Trip_ReportsInput" part="header2" use="literal"/>
				<soap:body parts="body" use="literal"/>
			</input>
			<output>
				<soap:header message="tns:Trip_ReportsOutput" part="header" use="literal"/>
				<soap:header message="tns:Trip_ReportsOutput" part="header2" use="literal"/>
				<soap:body parts="body" use="literal"/>
			</output>
		</operation>
	</binding>
	<service name="Trip_ReportsRQService">
		<port name="Trip_ReportsPortType" binding="tns:Trip_ReportsSoapBinding">
			<soap:address location="https://webservices.platform.sabre.com/websvc"/>
		</port>
	</service>
</definitions>
